const activities = [
{
        date: "2025-01-06",
        title: "活動開始",
        url: ""
    },
    {
        date: "2025-08-05",
        title: "蠟梅様お誕生日2025",
        url: ""
    },
{
        date: "2026-01-06",
        title: "活動1周年",
        url: ""
    },
{
        date: "2026-02-12",
        title: "蠟梅様3回目の活動開始",
        url: ""
    },
{
        date: "2026-02-15",
        title: "🌸のメイクを褒める彼ら",
        url: "https://x.com/mrmr_0103/status/2022815466595783048?s=20"
    },
{
        date: "2026-02-15",
        title: "🌸から『義理だから！』って🍫を渡された (照れ隠しなだけで実は本命) ※彼らは🍫💝をどんイベントか理解しているものとしています ❤️‍🔥⛪️🍺🧋🎩🪆🌀☂️🥧💃🈸💄",
        url: "https://x.com/mrmr_0103/status/2022971286063034496?s=20"
    },
{
        date: "2026-02-15",
        title: "🌸が闇オクに出品されちゃった！",
        url: "https://x.com/mrmr_0103/status/2022986277130477723?s=20"
    },
{
        date: "2026-02-15",
        title: "嫉妬という感情を知らない☂️様",
        url: "https://x.com/mrmr_0103/status/2023032333201482177?s=20"
    },
{
        date: "2026-02-15",
        title: "初めて🌸との👶赤ちゃんを見た彼ら",
        url: "https://x.com/mrmr_0103/status/2023046793932804525?s=20"
    },
{
        date: "2026-02-16",
        title: "🌸を🥫監禁したら嬉しそうにされた",
        url: "https://x.com/mrmr_0103/status/2023186267132096945?s=20"
    },
{
        date: "2026-02-16",
        title: "☂️に見つからないように隠れたお話 ※☂️がヤンデレ気味です",
        url: "https://x.com/mrmr_0103/status/2023275839488745493?s=20"
    },
{
        date: "2026-02-16",
        title: "リク プレイヤ一(🌸)から「今日も好きだよ」と言われ続けた彼ら(🌸は彼らには聞こえてないと思っている)",
        url: "https://x.com/mrmr_0103/status/2023355061506838760?s=20"
    },
{
        date: "2026-02-17",
        title: "嫌なことがあって🌸が泣きながら帰ってきた",
        url: "https://x.com/mrmr_0103/status/2023615916232372392?s=20"
    },
{
        date: "2026-02-17",
        title: "執行官達による愛し子(🌸)の扱い方 🧊⚔️.🧪🌙❌☂️🗝️🦋🐳",
        url: "https://x.com/mrmr_0103/status/2023758272789196816?s=20"
    },
{
        date: "2026-02-17",
        title: "🌸の運命の赤い糸🧵が他の👨と繋がってる",
        url: "https://x.com/mrmr_0103/status/2023964475515429316?s=20"
    },
{
        date: "2026-02-18",
        title: "名前で呼ばれたい❌様",
        url: "https://x.com/mrmr_0103/status/2024061145477173538?s=20"
    },
{
        date: "2026-02-18",
        title: "思議な力で何回人生(時間)をやり直しても🌸と結ばれない…",
        url: "https://x.com/mrmr_0103/status/2024076492767203654?s=20"
    },
{
        date: "2026-02-19",
        title: "不安になった🌸から『私以外見ないで』と言われたとき",
        url: "https://x.com/mrmr_0103/status/2024171252097949981?s=20"
    },
{
        date: "2026-02-19",
        title: "🌸から一緒に氵のうと言われたとき",
        url: "https://x.com/mrmr_0103/status/2024329648197554401?s=20"
    },
{
        date: "2026-02-19",
        title: "貴方の背が高くてキスができない！という🌸に対して 🕯️🍺🥃🧋",
        url: "https://x.com/mrmr_0103/status/2024378172532543536?s=20"
    },
{
        date: "2026-02-19",
        title: "旅行中はしゃぐ🌸を見たとき",
        url: "https://x.com/mrmr_0103/status/2024456604398305486?s=20"
    },
{
        date: "2026-02-19",
        title: "『嫉妬しすぎて辛いから離れる…』と🌸から言われたとき⛪️🍄🎧🧪🌀☂️",
        url: "https://x.com/mrmr_0103/status/2024471043117912343?s=20"
    },
{
        date: "2026-02-20",
        title: "人見知りな🌸が自分にだけ懐いてる",
        url: "https://x.com/mrmr_0103/status/2024697324052918663?s=20"
    },
{
        date: "2026-02-20",
        title: "🌸から他の執行官を褒められて嫉妬する執行官 🌙❌☂️🗝️🐳",
        url: "https://x.com/mrmr_0103/status/2024798560706089460?s=20"
    },
{
        date: "2026-02-20",
        title: "来世で一緒だよって約束したのに🌸は自分に見向きもしない ※🌸は前世の記憶ナシ",
        url: "https://x.com/mrmr_0103/status/2024829567526121824?s=20"
    },
{
        date: "2026-05-20",
        title: "『貴方は人じゃないから分からないんだよ！』と怒鳴ってしまった 🌀",
        url: "https://x.com/mrmr_0103/status/2024839035613777938?s=20"
    },
{
        date: "2026-02-21",
        title: "🌸を手に入れるため🌸の彼氏を手に掛けるヤンデレ男子達 ※始末される彼氏目線です、捏造注意 🐳🍁🧋🥃🟩🕯️🟡⛪️🌀☂️",
        url: "https://x.com/mrmr_0103/status/2024947696403185877?s=20"
    },
{
        date: "2026-02-21",
        title: "自分が🎮の中のキャラだと認識した彼ら",
        url: "https://x.com/mrmr_0103/status/2025067266312933392?s=20"
    },
{
        date: "2026-02-21",
        title: "月が綺麗ですね、の返答の仕方🕯️🐍🦉🍄🌌🍺🦚⛪️❤️‍🔥🦇🧋🌀☂️",
        url: "https://x.com/mrmr_0103/status/2025177322274660862?s=20"
    },
{
        date: "2026-02-22",
        title: "語尾に絶対「ニャン」が付くようになってしまった🌸に対して",
        url: "https://x.com/mrmr_0103/status/2025412856544723122?s=20"
    },
{
        date: "2026-02-22",
        title: "モブから「🌸が風邪を引いたらしい」と聞いた男子達",
        url: "https://x.com/mrmr_0103/status/2025519588629479653?s=20"
    },
{
        date: "2026-02-23",
        title: "🌸を手に入れるため🌸の彼氏を手に掛けるヤンデレ男子達Part2 ※始末される彼氏目線です、捏造注意 🍃🦚❤️‍🔥🍺🔶🎧🐧⚜️⛓️🥼",
        url: "https://x.com/mrmr_0103/status/2025600699107807269?s=20"
    },
{
        date: "2026-02-23",
        title: "これで一度ボツになった🎧です。一番大変でした。",
        url: "https://x.com/mrmr_0103/status/2025602051989012574?s=20"
    },
{
        date: "2026-02-23",
        title: "🌸が行方不明になっちゃった",
        url: "https://x.com/mrmr_0103/status/2025699776239673614?s=20"
    },
{
        date: "2026-02-23",
        title: "鍛錬の道で自分を選んでくれたことに対して🦉🐳🌼👹🧋🍄👁️‍🗨️🌀🐍",
        url: "https://x.com/mrmr_0103/status/2025835353505226825?s=20"
    },
{
        date: "2026-02-23",
        title: "🌸を口説く彼 ⛪️🌀",
        url: "https://x.com/mrmr_0103/status/2025918547436900598?s=20"
    },
{
        date: "2026-02-23",
        title: "いつの間にか🌸に好きな人ができた",
        url: "https://x.com/mrmr_0103/status/2025939983840981401?s=20"
    },

{
        date: "2026-02-24",
        title: "🌀夢です。かなりマイナス風味ですがもしよろしければ読んでいただけますと幸いです…！",
        url: "https://x.com/mrmr_0103/status/2025956870671024560?s=20"
    },
{
        date: "2026-02-24",
        title: "🐦ップしてきた🌸が元の世界へ帰れるというアイテムを手に入れたとき",
        url: "https://x.com/mrmr_0103/status/2026072324999647529?s=20"
    },
{
        date: "2026-02-24",
        title: "🌸から『別れたい』と言われて縋り付く男子達 ※縋り付いてるか怪しいです ⛪️🥃🌀☂️",
        url: "https://x.com/mrmr_0103/status/2026255693179961449?s=20"
    },
{
        date: "2026-02-25",
        title: "🌸から『貴方がいないと生きていけない！』と言われた",
        url: "https://x.com/mrmr_0103/status/2026464676130029842?s=20"
    },
{
        date: "2026-02-25",
        title: "『来世も貴方に会いたい』と言われたとき 🍃⛪️🦚❤️‍🔥🔶🧋🥼🍺🟡🌀☂️",
        url: "https://x.com/mrmr_0103/status/2026673279830995256?s=20"
    },
{
        date: "2026-02-26",
        title: "元力レがそうだったので『いつかは貴方も私から離れるんだよね』と言ってしまったとき",
        url: "https://x.com/mrmr_0103/status/2026757169073500378?s=20"
    },
{
        date: "2026-02-26",
        title: "🌸に手をあげちゃった",
        url: "https://x.com/mrmr_0103/status/2026869289358410189?s=20"
    },
{
        date: "2026-02-26",
        title: "🌸が見たことない💍を嵌めてる(※実は男避けなだけ)",
        url: "https://x.com/mrmr_0103/status/2027031541508087888?s=20"
    },
{
        date: "2026-02-27",
        title: "『私のこと好きでしょ！』と🌸から聞かれて図星な男子達 ❤️‍🔥⛪️🍺🕯️🧪🔷🌀☂️",
        url: "https://x.com/mrmr_0103/status/2027342181489598945?s=20"
    },
{
        date: "2026-02-28",
        title: "リク 彼より身長が高い🌸に対して",
        url: "https://x.com/mrmr_0103/status/2027604027605979460?s=20"
    },
{
        date: "2026-02-28",
        title: "想いを寄せている🌸から恋愛相談されて複雑な彼女達 💫🪽💎💭🌿💄💧🍹🌙🗝️❌",
        url: "https://x.com/mrmr_0103/status/2027664533859537162?s=20"
    },
{
        date: "2026-02-28",
        title: "相手の好きなところを累計100個言わないと出られない秘境",
        url: "https://x.com/mrmr_0103/status/2027708905313472918?s=20"
    },
{
        date: "2026-03-01",
        title: "行方不明だった🌸が急に帰ってきた",
        url: "https://x.com/mrmr_0103/status/2027870838914224308?s=20"
    },
{
        date: "2026-03-01",
        title: "明日が来るのが怖くて眠れない🌸に対して… 🟩⛪️🕯️🍺🌀💎",
        url: "https://x.com/mrmr_0103/status/2028061632795185417?s=20"
    },
{
        date: "2026-03-03",
        title: "慰めてくれた彼に『それでも私は頑張らなくちゃいけないの！』と八つ当たりしてしまったとき ⛅️⛪️🍁🟡🌀☂️",
        url: "https://x.com/mrmr_0103/status/2028492609338093889?s=20"
    },
{
        date: "2026-03-03",
        title: "🌸に恋人ができた🔷の話",
        url: "https://x.com/mrmr_0103/status/2028507130626793512?s=20"
    },
{
        date: "2026-03-03",
        title: "照れさせたいのに強がって中々照れない🌸に対して",
        url: "https://x.com/mrmr_0103/status/2028601928977105190?s=20"
    },
{
        date: "2026-03-03",
        title: "嫉妬した彼ら❤️‍🔥🐯⛪️🧋🌼🍨🐍⚜️🕯️🌀☂️📜❌",
        url: "https://x.com/mrmr_0103/status/2028602473922138186?s=20"
    },
{
        date: "2026-03-04",
        title: "片方が相手に関する記憶を無くしてしまう薬を飲まないと出られない秘境※恋人同士",
        url: "https://x.com/mrmr_0103/status/2029113891272433857?s=20"
    },
{
        date: "2026-03-04",
        title: "月が綺麗ですねの返答",
        url: "https://x.com/mrmr_0103/status/2029114590500639132?s=20"
    },
{
        date: "2026-03-04",
        title: "下半身が太めなのを気にする🌸に対して",
        url: "https://x.com/mrmr_0103/status/2029198096404758619?s=20"
    },
{
        date: "2026-03-05",
        title: "月が綺麗だね　🌀",
        url: "https://x.com/mrmr_0103/status/2029266027419451881?s=20"
    },
{
        date: "2026-03-05",
        title: "『月が綺麗ですね』☂️",
        url: "https://x.com/mrmr_0103/status/2029271969590591757?s=20"
    },
{
        date: "2026-03-05",
        title: "『私のこと好き？』って聞いてみた❤️‍🔥🍃🧋🍺🌌⛪️🟡🪆🌀☂️",
        url: "https://x.com/mrmr_0103/status/2029411944562868258?s=20"
    },
{
        date: "2026-03-05",
        title: "🌸の誕生日を祝うとき…",
        url: "https://x.com/mrmr_0103/status/2029512229528404092?s=20"
    },
{
        date: "2026-03-06",
        title: "🌸にメロメロな男子達 ※捏造注意🍃⛪️👍🔷🟩🕯️🌀☂️",
        url: "https://x.com/mrmr_0103/status/2029678432276435448?s=20"
    },
{
        date: "2026-03-06",
        title: "リク 💊を沢山飲んでしまった🌸に対して🐍🍁🦌🌀",
        url: "https://x.com/mrmr_0103/status/2029812530592501984?s=20"
    },
{
        date: "2026-03-06",
        title: "リク 男性が苦手な🌸に対して",
        url: "https://x.com/mrmr_0103/status/2029892417479135465?s=20"
    },
{
        date: "2026-03-07",
        title: "リク(Part2)💊を沢山飲んでしまった🌸に対して🍃📘👹🐶🎩🟩☂️🕊️💭💎🐈‍⬛❌🔷",
        url: "https://x.com/mrmr_0103/status/2029998751973265863?s=20"
    },
{
        date: "2026-03-07",
        title: "自らの不注意で🌸を死なせてしまった",
        url: "https://x.com/mrmr_0103/status/2030178479086653465?s=20"
    },
{
        date: "2026-03-07",
        title: "🌸が目の前で致命傷を負って死んでしまった 🌀☂️",
        url: "https://x.com/mrmr_0103/status/2030179412558369190?s=20"
    },
{
        date: "2026-03-07",
        title: "デート中他の👩に「そんな子より私にしなよ♡」って言われた男子達",
        url: "https://x.com/mrmr_0103/status/2030259663854539172?s=20"
    },
{
        date: "2026-03-07",
        title: "ホストパロ 本気で彼のことを好きになって告白した🌸のことを「ホス卜なんかに恋しちゃだめだよ」と断る男子達 🍃🦉🦚❤️‍🔥🌼⛪️🍺🍁🌀🕯️",
        url: "https://x.com/mrmr_0103/status/2030273948576071896?s=20"
    },
{
        date: "2026-03-08",
        title: "フォロワー1000人達成!",
        url: "https://x.com/mrmr_0103/status/2030604468602167360?s=20"
    },
{
        date: "2026-03-08",
        title: "🌸が着ている大きめの👕が肩から落ちそうになってるのに気付いた男子達",
        url: "https://x.com/mrmr_0103/status/2030395818352750661?s=20"
    },
{
        date: "2026-03-09",
        title: "リク 恋愛初心者！な彼ら※かなり捏造注意",
        url: "https://x.com/mrmr_0103/status/2030764546043105778?s=20"
    },
{
        date: "2026-03-10",
        title: "吸血鬼🌸に「血吸わせて」っておねだりされたとき",
        url: "https://x.com/mrmr_0103/status/2031251721339679118?s=20"
    },
{
        date: "2026-03-10",
        title: "任務を失敗したときの部下(🌸)とその他の違い※甘いです、幻覚強め ☂️",
        url: "https://x.com/mrmr_0103/status/2031278771173732376?s=20"
    },
{
        date: "2026-03-10",
        title: "🌸からの“好き”を自覚している彼ら ❤️‍🔥⛪️🕯️🍺📘🌀",
        url: "https://x.com/mrmr_0103/status/2031325488233513056?s=20"
    },
{
        date: "2026-03-11",
        title: "婚約した翌日に記憶喪失になった🌸が『貴方と結婚できる女性は幸せですね』と言ったとき",
        url: "https://x.com/mrmr_0103/status/2031673845661450472?s=20"
    },
{
        date: "2026-03-12",
        title: "『お人形なのに私のこと好きなの？』 🌀",
        url: "https://x.com/mrmr_0103/status/2031770770817548794?s=20"
    },
{
        date: "2026-03-12",
        title: "🌸が🌸の友人を庇ってなくなった",
        url: "https://x.com/mrmr_0103/status/2031849624722686212?s=20"
    },
{
        date: "2026-03-12",
        title: "嫉妬してご機嫌斜めな🌸に対して 🐍🎩🟩🦇🕯️🌀",
        url: "https://x.com/mrmr_0103/status/2032065229346283990?s=20"
    },
{
        date: "2026-03-12",
        title: "吸血鬼パロ🩸が吸いたい彼ら",
        url: "https://x.com/mrmr_0103/status/2032094677466566991?s=20"
    },
{
        date: "2026-03-13",
        title: "最期は貴方の手で。 🌀",
        url: "https://x.com/mrmr_0103/status/2032272004355858650?s=20"
    },
{
        date: "2026-03-14",
        title: "『ホワイトデーのお返しに貴方が欲しい』と言われた彼ら ※書いてたら🤍デーほぼ関係なくなりました❤️‍🔥⛪️🍺🔷⛓️🕯️🌀☂️",
        url: "https://x.com/mrmr_0103/status/2032471769274315058?s=20"
    },
{
        date: "2026-03-14",
        title: "照れ性で目を見て話すことすらできない🌸に対して",
        url: "https://x.com/mrmr_0103/status/2032567076683165838?s=20"
    },
{
        date: "2026-03-14",
        title: "『私ばっかり好きみたい』 🏹",
        url: "https://x.com/mrmr_0103/status/2032782893827907769?s=20"
    },
{
        date: "2026-03-15",
        title: "どうでもいい喧嘩をして🌸に涙目で「嫌い！」って言われちゃった彼ら",
        url: "https://x.com/mrmr_0103/status/2033135958003245162?s=20"
    },
{
        date: "2026-03-16",
        title: "リク 寝つきの悪い🌸に対して 🪆☂️🌀",
        url: "https://x.com/mrmr_0103/status/2033301561280168320?s=20"
    },
{
        date: "2026-03-17",
        title: "独占欲はあるのに痕をつけるのが下手で泣いちゃった🌸に対して",
        url: "https://x.com/mrmr_0103/status/2033662074266718534?s=20"
    },
{
        date: "2026-03-19",
        title: "ヤンデレ化した🌸に対して…",
        url: "https://x.com/mrmr_0103/status/2034303426398720049?s=20"
    },
{
        date: "2026-03-21",
        title: "自分は🌸の彼氏だと思い込んでいるヤンデレ男子が🌸の本当の彼氏と出会っちゃった 🕯️🥃⛪️🧪🌀☂️",
        url: "https://x.com/mrmr_0103/status/2035101468018319768?s=20"
    },
{
        date: "2026-03-21",
        title: "🌸がずっと原因不明で眠ったまま",
        url: "https://x.com/mrmr_0103/status/2035117311062155570?s=20"
    },
{
        date: "2026-03-22",
        title: "🌸の父親に交際を反対された",
        url: "https://x.com/mrmr_0103/status/2035483536384565314?s=20"
    },
{
        date: "2026-03-23",
        title: "リク 幽霊になった🌸と再開するお話 🍺",
        url: "https://x.com/mrmr_0103/status/2035867319289962499?s=20"
    },
{
        date: "2026-03-23",
        title: "元力レの名前で呼んじゃった 🔷⛓️⚜️🍄🌼🕯️⛪️🧋🔶🍁🌀☂️",
        url: "https://x.com/mrmr_0103/status/2036066298837532728?s=20"
    },
{
        date: "2026-03-24",
        title: "嫌いが言えない🌀の話",
        url: "https://x.com/mrmr_0103/status/2036206131127918802?s=20"
    },
{
        date: "2026-03-26",
        title: "リク プレイボーイだと有名な👨に口説かれて満更でもない顔をしている🌸に対して※恋人未満",
        url: "https://x.com/mrmr_0103/status/2036881640153374904?s=20"
    },
{
        date: "2026-03-27",
        title: "他のキャラに『愛してる！』って言ってたの見ちゃった彼ら",
        url: "https://x.com/mrmr_0103/status/2037356546603311216?s=20"
    },
{
        date: "2026-03-28",
        title: "垢抜けた🌸と再会したら",
        url: "https://x.com/mrmr_0103/status/2037688335720988939?s=20"
    },
{
        date: "2026-03-28",
        title: "リク 両目が見えなくなってしまった🌸に対して 🕯️🌙",
        url: "https://x.com/mrmr_0103/status/2037870776553279577?s=20"
    },
{
        date: "2026-03-29",
        title: "初めまして、あなたの彼氏です 🍺⛪️🔷🍁🐧🕯️🌀☂️",
        url: "https://x.com/mrmr_0103/status/2037997854804058375?s=20"
    },
{
        date: "2026-03-29",
        title: "「女同士なんてヘンなの〜笑」🔥📜🌙💎💧🪷🦈🍹🍴💭🦢⚡️🥀クロリンデ",
        url: "https://x.com/mrmr_0103/status/2038103348638024150?s=20"
    },
{
        date: "2026-04-01",
        title: "他の👨とデートしてくる！と嘘をついてみた",
        url: "https://x.com/mrmr_0103/status/2039064466705506693?s=20"
    },
{
        date: "2026-04-01",
        title: "8番出口パロ、🌸が異変として現れたら ❤️‍🔥🌼⛪️🍺📘👹🌀☂️",
        url: "https://x.com/mrmr_0103/status/2039343230068867345?s=20"
    },
{
        date: "2026-04-02",
        title: "リク 嫉妬して彼を避けるお話 🍄",
        url: "https://x.com/mrmr_0103/status/2039608134264869210?s=20"
    },
{
        date: "2026-04-02",
        title: "リク 情緒不安定な🌸に対して",
        url: "https://x.com/mrmr_0103/status/2039637451875168394?s=20"
    },
{
        date: "2026-04-02",
        title: "彼のことが好きなのに完凸できない🌸に対して",
        url: "https://x.com/mrmr_0103/status/2039644122341122149?s=20"
    },
{
        date: "2026-04-03",
        title: "ピアス開けて、と頼んでみた",
        url: "https://x.com/mrmr_0103/status/2040008799868854683?s=20"
    },
{
        date: "2026-04-04",
        title: "私のことなんか大して好きじゃないくせに 🍺🔷⛪️🍄🐧🟡🌀☂️",
        url: "https://x.com/mrmr_0103/status/2040244615580885181?s=20"
    },
{
        date: "2026-04-05",
        title: "リク 他のキャラに目移りした🌸に対して ※悲恋気味？ ⛅️🌀",
        url: "https://x.com/mrmr_0103/status/2040574777027653638?s=20"
    },
{
        date: "2026-04-05",
        title: "荷物を持とうと手を差し出したら手を乗せられたとき",
        url: "https://x.com/mrmr_0103/status/2040588665911709923?s=20"
    },
{
        date: "2026-04-05",
        title: "🥫監禁から逃げ出したら… 🪽💎💄🍹🌙🗝️",
        url: "https://x.com/mrmr_0103/status/2040725488424063480?s=20"
    },
{
        date: "2026-04-06",
        title: "リク 🌸と腕相撲をした彼ら",
        url: "https://x.com/mrmr_0103/status/2040884925243806190?s=20"
    },
{
        date: "2026-04-07",
        title: "🌸に甘えたいときの彼ら",
        url: "https://x.com/mrmr_0103/status/2041289935647600931?s=20"
    },
{
        date: "2026-04-08",
        title: "初恋は叶わないらしい、ということを聞いてしまった🌸が初恋の男子達👍🐺🐶🎩🐧🟡🪆🌀",
        url: "https://x.com/mrmr_0103/status/2041677189784203774?s=20"
    },
{
        date: "2026-04-09",
        title: "喧嘩して『もういい！別れる！』と言ったとき",
        url: "https://x.com/mrmr_0103/status/2042129271335088271?s=20"
    },
{
        date: "2026-04-10",
        title: "🌸に復縁を迫る彼ら(🌸は復縁する気なし)",
        url: "https://x.com/mrmr_0103/status/2042522458830610899?s=20"
    },
{
        date: "2026-04-11",
        title: "何度生まれ変わっても貴方と ⚠️生まれ変わり後の夢主を🌸と表記しています。内容は人を選びます。 🍃❤️‍🔥🌼🔶☂️🌀",
        url: "https://x.com/mrmr_0103/status/2042835231074587066?s=20"
    },

{
        date: "2026-04-11",
        title: "6.5の🔷を履修してないので没になったやつです。なんでも許せる方のみお納めください…",
        url: "https://x.com/mrmr_0103/status/2042886812553892194?s=20"
    },
{
        date: "2026-04-11",
        title: "プレイヤ一(🌸)が別の≠ャラを推してる",
        url: "https://x.com/mrmr_0103/status/2042893702767743230?s=20"
    },
{
        date: "2026-04-12",
        title: "他の👨に夢中な🌸と嫉妬した🌀 ※願望、捏造注意、ヤンデレ(気味)",
        url: "https://x.com/mrmr_0103/status/2043055165654339992?s=20"
    },
{
        date: "2026-04-12",
        title: "フォロワー1200人達成!",
        url: "https://x.com/mrmr_0103/status/2043235435649098044?s=20"
    },
{
        date: "2026-04-12",
        title: "🌸が『もういっそあなたのお嫁さんになれたら幸せなのに』と呟いた🦉❤️‍🔥🍺🧋🥃🟩🟡🪆☂️🌀",
        url: "https://x.com/mrmr_0103/status/2043288331946279154?s=20"
    },
{
        date: "2026-04-13",
        title: "🌸が子供から「ぼくとけっこんして！」って言われてる",
        url: "https://x.com/mrmr_0103/status/2043567662098423866?s=20"
    },
{
        date: "2026-04-14",
        title: "リク デート中に彼にあーん、してみた",
        url: "https://x.com/mrmr_0103/status/2043986986810388723?s=20"
    },
{
        date: "2026-04-15",
        title: "任務だって駆けつけてね ※ヤンデレ、捏造 ☂️",
        url: "https://x.com/mrmr_0103/status/2044369272017912001?s=20"
    },
{
        date: "2026-04-16",
        title: "『別れたい』って言ってみた",
        url: "https://x.com/mrmr_0103/status/2044691410864218591?s=20"
    },
{
        date: "2026-04-17",
        title: "『浮気したらどうする？』って聞いてみた ※捏造多め",
        url: "https://x.com/mrmr_0103/status/2045121164859846663?s=20"
    },
{
        date: "2026-04-18",
        title: "☂️夢(？)捏造＆願望",
        url: "https://x.com/mrmr_0103/status/2045210357954904321?s=20"
    },
{
        date: "2026-04-18",
        title: "🌸に翻弄される🌀を真剣に考えた結果、",
        url: "https://x.com/mrmr_0103/status/2045399103308468507?s=20"
    },
{
        date: "2026-04-19",
        title: "ネップリ第2弾",
        url: ""
    },
{
        date: "2026-04-20",
        title: "🐦ップしてきた🌸を元の世界に戻すことができるアイテムを手に入れたとき🍺⛪️🔷🎧🥃🟩🌀☂️",
        url: "https://x.com/mrmr_0103/status/2045882230158098693?s=20"
    },
{
        date: "2026-04-20",
        title: "自分の愛は歪んでいるから…ということで🌸からの告白を断る彼ら🦚🍺🌌🌀",
        url: "https://x.com/mrmr_0103/status/2046138155905212491?s=20"
    },
{
        date: "2026-04-20",
        title: "🌸不在時、🌸の元力レの写真を見つけてしまったとき",
        url: "https://x.com/mrmr_0103/status/2046160324060143829?s=20"
    },
{
        date: "2026-04-20",
        title: "魔女会はやっぱり超越した存在だからガチャで引いた🌸に「(お呼びかしら？)」「(わざわざ引いてくれて嬉しいわ)」とか話しかける🪽はあまりにも自然すぎると個人的に思ってます。",
        url: "https://x.com/mrmr_0103/status/2046164418665603189?s=20"
    },
{
        date: "2026-04-20",
        title: "許して！☂️様！ ※甘いし捏造",
        url: "https://x.com/mrmr_0103/status/2046174955122151775?s=20"
    },
{
        date: "2026-04-21",
        title: "片想いしてる🌸から「好きな人いる？」って聞かれたとき",
        url: "https://x.com/mrmr_0103/status/2046550052446011583?s=20"
    },
{
        date: "2026-04-22",
        title: "寿命でこの世から去ってしまった🌸という存在をゆっくりと咀嚼するように受け入れていく🌀。",
        url: "https://x.com/mrmr_0103/status/2046939813996278210?s=20"
    },
{
        date: "2026-04-22",
        title: "リクですウィンクしながら投げキッスしてみた",
        url: "https://x.com/mrmr_0103/status/2046952290289168860?s=20"
    },
{
        date: "2026-04-23",
        title: "🌀夢 ※マイナス、謎シチュ",
        url: "https://x.com/mrmr_0103/status/2047004777901650192?s=20"
    },
{
        date: "2026-04-23",
        title: "🌸から恋愛感情ではなく、敬愛を向けられていたことを知って恋ｉ心を自覚した男子達 👁️‍🗨️🥃🟡⛅️🌀☂️",
        url: "https://x.com/mrmr_0103/status/2047290192416186410?s=20"
    },
{
        date: "2026-04-24",
        title: "リク 自己肯定感が低い🌸に対して",
        url: "https://x.com/mrmr_0103/status/2047408867303424267?s=20"
    },
{
        date: "2026-04-24",
        title: "リク 顔(笑顔)がコンプレックスで顔を隠してしまう🌸に対して 🍁🦌🎧🕯️☂️🌀",
        url: "https://x.com/mrmr_0103/status/2047535674048626859?s=20"
    },
{
        date: "2026-04-25",
        title: "彼からの反対を聞かず🌸が無断で元の世界に帰っちゃった ❤️‍🔥🔷🥼🦇🌀☂️",
        url: "https://x.com/mrmr_0103/status/2047967714917101665?s=20"
    },
{
        date: "2026-04-26",
        title: "🐦ップしてきた🌸が元の世界の彼氏の惚気話ばかりするとき",
        url: "https://x.com/mrmr_0103/status/2048324002712805790?s=20"
    },
{
        date: "2026-04-27",
        title: "告白したけど「練習だから！」と言い訳しちゃった 🍺🔷🍨🍁🟩🕯️🌀☂️",
        url: "https://x.com/mrmr_0103/status/2048699289149518131?s=20"
    },
{
        date: "2026-04-27",
        title: "「君は本当にずるい女だね」ってやけくそなキスをする🌀はどこですか",
        url: "https://x.com/mrmr_0103/status/2048733266140877181?s=20"
    },
{
        date: "2026-04-28",
        title: "🌸を手に入れるため🌸の彼氏を手に掛けるヤンデレな彼女達 ※始末される彼氏目線です。捏造注意🍹🦢🌙❌🗝️🦋",
        url: "https://x.com/mrmr_0103/status/2048819883518177688?s=20"
    },
{
        date: "2026-04-29",
        title: "リク 🌸が余命宣告されたとき",
        url: "https://x.com/mrmr_0103/status/2049388244081791111?s=20"
    },
{
        date: "2026-04-29",
        title: "🌸のこと催眠とかなんやかんやして本物の彼氏から奪ったあと彼氏が☂️様の元までやってきて「🌸を返せ！」",
        url: "https://x.com/mrmr_0103/status/2049390509232443814?s=20"
    },
{
        date: "2026-04-30",
        title: "呼吸になった🌸に「落ち着いて息を吸ってごらん。…ん、よくできたね。」って言う🌀メロくないですか？",
        url: "https://x.com/mrmr_0103/status/2049520048172347743?s=20"
    },
{
        date: "2026-04-30",
        title: "🌸が痩せたいな…って呟いたとき",
        url: "https://x.com/mrmr_0103/status/2049780843678470382?s=20"
    },
{
        date: "2026-4-30",
        title: "元力レの名前で呼んじゃった話 📚",
        url: "https://x.com/mrmr_0103/status/2049791245778915465?s=20"
    },
{
        date: "2026-05-01",
        title: "🌀「…そんなに耳を当てても僕の心臓の音なんて聞こえないよ。」 🌸『分かってるよ』",
        url: "https://x.com/mrmr_0103/status/2049874527682023791?s=20"
    },
{
        date: "2026-05-01",
        title: "ご都合秘境で🌸が甘えた構ってちゃんになっちゃった",
        url: "https://x.com/mrmr_0103/status/2049962378327126333?s=20"
    },
{
        date: "2026-05-01",
        title: "🌀、🌸のことを想って自分なんかとは精神的に疲れるから付き合わない方がいいって振るくせにずっと未練タラタラだといい。",
        url: "https://x.com/mrmr_0103/status/2050206040919244909?s=20"
    },
{
        date: "2026-05-02",
        title: "記憶喪失になった🌸が自分のことを恋人だと勘違いしてきたとき",
        url: "https://x.com/mrmr_0103/status/2050537535206813870?s=20"
    },
{
        date: "2026-05-03",
        title: "🌸『愛してるって言わないでほしい』🌀「…欲しくて堪らないくせに？」",
        url: "https://x.com/mrmr_0103/status/2050869657905873086?s=20"
    },
{
        date: "2026-05-03",
        title: "喧嘩して🌸から『もういい！別れる！』と言われちゃった彼ら ❤️‍🔥🌼🔷🧋🍄🕯️🌀☂️",
        url: "https://x.com/mrmr_0103/status/2050928820547715409?s=20"
    },
{
        date: "2026-05-03",
        title: "☂️様、愛が足りないというか虚無感に苛まれてどうしようもないときは側に侍らせてる🌸の唇に噛み付くように荒々しくキスをしててほしい。",
        url: "https://x.com/mrmr_0103/status/2050939795598459056?s=20"
    },
{
        date: "2026-05-04",
        title: "🌸から『☂️様のお顔って美しいですね』って見事触れられたくないところに触れられてカッとなった☂️様",
        url: "https://x.com/mrmr_0103/status/2051168703795134733?s=20"
    },
{
        date: "2026-05-05",
        title: "どちらかが相手に甘えないと出られない秘境 ⛓️🎧🍺🧋🦉🦚🟡🍃⛪️❤️‍🔥🌀☂️",
        url: "https://x.com/mrmr_0103/status/2051565026037952835?s=20"
    },
{
        date: "2026-05-05",
        title: "☂️様お金とかに執着なさそうだから🌸に無自覚に金使ってるといいなと毎日思ってます。",
        url: "https://x.com/mrmr_0103/status/2051571557663924602?s=20"
    },
{
        date: "2026-05-05",
        title: "相手側が🌸との記憶を抱えたまま一生引きずっていく…っていうシチュが大好きなのでね、🌀はよくそうなりがちです。",
        url: "https://x.com/mrmr_0103/status/2051627953587667274?s=20"
    },
{
        date: "2026-05-06",
        title: "🌀、病や寿命によるものは仕方ないものとして受け入れられるようになっていたとしても🌸が自ら生を手放す行為自体は許せなさそう。",
        url: "https://x.com/mrmr_0103/status/2051698149786517911?s=20"
    },
{
        date: "2026-05-07",
        title: "リク 普段大人しい🌸が作業に没頭しているのを目撃した彼ら",
        url: "https://x.com/mrmr_0103/status/2052273815775060225?s=20"
    },
{
        date: "2026-",
        title: "死を簡単に受け入れられない☂️様",
        url: "https://x.com/mrmr_0103/status/2052286353782845460?s=20"
    },
{
        date: "2026-05-07",
        title: "🌸に愛されてる自覚のある🌀。",
        url: "https://x.com/mrmr_0103/status/2052287458457641124?s=20"
    },
{
        date: "2026-05-07",
        title: "常に相手を羨ましいって思い続けてる🌀🌸があったっていいと思ってます。",
        url: "https://x.com/mrmr_0103/status/2052342015808118831?s=20"
    },
{
        date: "2026-05-08",
        title: "『貴方の香りって風みたい』って🌸に言われてもおかしくないような見た目の軌跡でとても嬉しい。そんな🌀🌸を考えながら🌀動かせるのか…。",
        url: "https://x.com/mrmr_0103/status/2052735902561292765?s=20"
    },
{
        date: "2026-05-09",
        title: "🌸から彼氏を紹介された際、🌸不在時の彼氏と彼らの会話 ❤️‍🔥🍺🎧🧪🌀☂️",
        url: "https://x.com/mrmr_0103/status/2053035171038060844?s=20"
    },
{
        date: "2026-05-09",
        title: "「こんな余計な感情全部、君が教えたんじゃないか」って🌸に泣きつく🌀がいたっていい。",
        url: "https://x.com/mrmr_0103/status/2053083557837566037?s=20"
    },
{
        date: "2026-05-10",
        title: "リク 🌸が彼のために料理を作ったけれど大失敗したとき",
        url: "https://x.com/mrmr_0103/status/2053379391644999714?s=20"
    },
{
        date: "2026-05-10",
        title: "🌸「最近考え事してること多いね？」 🌀「…ずっと頭から離れない奴がいてね。」",
        url: "https://x.com/mrmr_0103/status/2053420362818564298?s=20"
    },
{
        date: "2026-05-11",
        title: "可愛い🌸が気に入らない。🌀",
        url: "https://x.com/mrmr_0103/status/2053602597756645570?s=20"
    },
{
        date: "2026-05-11",
        title: "戦闘初心者の🌸と🔷が共闘したときにちょっとした攻撃でよろよろになってる🌸を見て",
        url: "https://x.com/mrmr_0103/status/2053604483448598605?s=20"
    },
{
        date: "2026-05-11",
        title: "執行官様！任務失敗しちゃいました！🧊⚔️.🧪🌙❌☂️🗝️🦋🐳",
        url: "https://x.com/mrmr_0103/status/2053618694069297165?s=20"
    },
{
        date: "2026-05-12",
        title: "プ口ポ一ズの言葉",
        url: "https://x.com/mrmr_0103/status/2053945943196918247?s=20"
    },
{
        date: "2026-05-13",
        title: "君が僕を捨てる？あり得ないだろう。」なんて自信満々に振る舞う🌀。",
        url: "https://x.com/mrmr_0103/status/2054219220528017818?s=20"
    },
{
        date: "2026-05-13",
        title: "『元力レの方が良かった』と衝動的に言ってしまったときの彼らからの一言",
        url: "https://x.com/mrmr_0103/status/2054399494218010713?s=20"
    },
{
        date: "2026-05-14",
        title: "嫌なことがあって泣いて帰ってきた🌸に対して",
        url: "https://x.com/mrmr_0103/status/2054582904198721578?s=20"
    },
{
        date: "2026-05-17",
        title: "🌸の📱の中の自分に嫉妬した🐳🎧🍃❤️‍🔥🎩🌀💧🌙",
        url: "https://x.com/mrmr_0103/status/2055931465062597060?s=20"
    },
{
        date: "2026-05-18",
        title: "⚠️次の魔神任務前の🌀と🌸の会話の捏造&妄想。なんでも許せる向けです。",
        url: "https://x.com/mrmr_0103/status/2056293990992064765?s=20"
    },
{
        date: "2026-05-19",
        title: "「ごめんなさい、好きです」と伝えたとき 🌀☂️",
        url: "https://x.com/mrmr_0103/status/2056623549906051260?s=20"
    },
{
        date: "2026-05-19",
        title: "『貴方からの愛が軽すぎる！』と言ったら ❤️‍🔥🌼🍺🍁🎩🌌🌀☂️",
        url: "https://x.com/mrmr_0103/status/2056733592764731647?s=20"
    },
{
        date: "2026-05-20",
        title: "リク 🌸が寝ながら涙を流していたら",
        url: "https://x.com/mrmr_0103/status/2057053294162583608?s=20"
    },
{
        date: "2026-05-21",
        title: "別れたいと言ったら拒否されるだけの話 🌀",
        url: "https://x.com/mrmr_0103/status/2057114422838284484?s=20"
    },
{
        date: "2026-05-21",
        title: "喧嘩して「嫌い！」と言ったら💄🐆🐈‍⬛🎒🗝️🦋💎🪽",
        url: "https://x.com/mrmr_0103/status/2057409260733321337?s=20"
    },
{
        date: "2026-05-22",
        title: "🌸から🌸の元力レの話を聞かないと出られない秘境",
        url: "https://x.com/mrmr_0103/status/2057777061188776181?s=20"
    },
{
        date: "2026-05-23",
        title: "事故チューしちゃった ❤️‍🔥🍺🔷📘🟩🕯️🌀☂️",
        url: "https://x.com/mrmr_0103/status/2057972282702823750?s=20"
    },
{
        date: "2026-05-23",
        title: "リク 貴方の片目が見たい！ 🎩",
        url: "https://x.com/mrmr_0103/status/2058152012177690947?s=20"
    },
{
        date: "2026-05-24",
        title: "『他に好きな人ができた』と嘘をついたらバレバレだった話 🃏(🦚)",
        url: "https://x.com/mrmr_0103/status/2058356306705293767?s=20"
    },
{
        date: "2026-5-24",
        title: "地脈異常で彼が分裂しちゃった",
        url: "https://x.com/mrmr_0103/status/2058487264343429471?s=20"
    },
{
        date: "2026-05-25",
        title: "🌸が他の男といる現場を目撃した",
        url: "https://x.com/mrmr_0103/status/2058858711914025218?s=20"
    },
{
        date: "2026-05-25",
        title: "とある🟩好きマロ主様からのリクを書いていたのですが明らかにボツになったので供養…。",
        url: "https://x.com/mrmr_0103/status/2058870668197077064?s=20"
    },
{
        date: "2026-05-26",
        title: "リク 彼らの正体(執…官であること)を知ってしまった🌸が『別れよう』と言ったら 🧊⚔️.🧪🌙❌☂️🗝️🦋🪙🐳",
        url: "https://x.com/mrmr_0103/status/2059204565350961461?s=20"
    },
{
        date: "2026-05-27",
        title: "自分のせいで怪我を負った🌸の最期の言葉が「ごめんね、大好き」だった 🍺🍁🌀☂️",
        url: "https://x.com/mrmr_0103/status/2059416931032261016?s=20"
    },
{
        date: "2026-05-28",
        title: "リク 🌸の家に逆🐦ップしてきた彼ら ※彼らは今まで画面越しに🌸に想いを寄せていること前提",
        url: "https://x.com/mrmr_0103/status/2059988484845388195?s=20"
    },
{
        date: "2026-05-29",
        title: "リク 彼の👶を身籠ったと伝えたら ※なんでも許せる方向け、おまけ有 🌀☂️",
        url: "https://x.com/mrmr_0103/status/2060284666608038326?s=20"
    },
{
        date: "2026-05-30",
        title: "🌸が彼に触れるとメ口メ口になる ※ご都合土也脈異常 ❤️‍🔥🍨🍄🎧🕯️🟡🌀☂️",
        url: "https://x.com/mrmr_0103/status/2060704710152405455?s=20"
    },
{
        date: "2026-06-01",
        title: "リク 普段積極的じゃない🌸が急にデレてきたら ※🟩の短いおまけ有",
        url: "https://x.com/mrmr_0103/status/2061113599771529593?s=20"
    },
{
        date: "2026-06-02",
        title: "勢いで逆プ口ポ一ズしたら ❤️‍🔥🍺👹🎩🌀☂️",
        url: "https://x.com/mrmr_0103/status/2061814174213399026?s=20"
    },
{
        date: "2026-06-03",
        title: "彼から愛されているからと浮気を繰り返す🌸に対して ☂️",
        url: "https://x.com/mrmr_0103/status/2061861659526992279?s=20"
    },
{
        date: "2026-06-03",
        title: "リク 全然ログインしない🌸に諦めがついてきた頃🌸が久々にログインしてきたとき ※2枚目はおまけ",
        url: "https://x.com/mrmr_0103/status/2062184705668386834?s=20"
    },
{
        date: "2026-06-04",
        title: "(僕/俺)には君(🌸)しかいないんだ！ 🍁🔷🌀☂️",
        url: "https://x.com/mrmr_0103/status/2062538543231275146?s=20"
    },
{
        date: "2026-06-05",
        title: "自分を庇って🌸が死んだ",
        url: "https://x.com/mrmr_0103/status/2062633053999292756?s=20"
    },
{
        date: "2026-06-06",
        title: "“🌸ちゃん”って呼ばないで⚠️駄文注意 ❤️‍🔥",
        url: "https://x.com/mrmr_0103/status/2063022915965354438?s=20"
    },
{
        date: "2026-06-08",
        title: "🌸『どうしよう、貴方のこと好きになっちゃいそう！』 ⛪️🔷🦌🍄🌀☂️",
        url: "https://x.com/mrmr_0103/status/2063794378649620504?s=20"
    },
{
        date: "2026-06-09",
        title: "⚠️夢 🌸の悪口が聞こえたとき 🌀☂️",
        url: "https://x.com/mrmr_0103/status/2064039675317387548?s=20"
    },
{
        date: "2026-06-09",
        title: "⚠️夢 モブが🌸の顔の悪口を言ったとき 🌀☂️",
        url: "https://x.com/mrmr_0103/status/2064040842839670922?s=20"
    },
{
        date: "2026-06-10",
        title: "👨から「🌸にラブレ夕一を渡してほしい」と頼まれたときの彼ら",
        url: "https://x.com/mrmr_0103/status/2064655533538517221?s=20"
    },
{
        date: "2026-06-10",
        title: "☂️様は無表情のままその場で破くかと…でも怒ったっていい。",
        url: "https://x.com/mrmr_0103/status/2064656252886720560?s=20"
    },
{
        date: "2026-06-14",
        title: "🌸が『貴方と釣り合ってない気がする』と言ったとき ❤️‍🔥🍺⛪️🔷👹🛡️🦌🍁🍄🎧🟩🕯️🌌🪙🌀☂️",
        url: "https://x.com/mrmr_0103/status/2065913854027256209?s=20"
    },
{
        date: "2026-06-15",
        title: "リク 🥫監禁されたことが嬉しくて堪らない🌸と彼ら 🥃🕯️🌀☂️",
        url: "https://x.com/mrmr_0103/status/2066485062632362123?s=20"
    },
{
        date: "2026-06-18",
        title: "🌸から『別れよう』って言われた ❤️‍🔥⛪️🔷🍺⏳🐧🌀☂️ ※捏造&ヤンデレ",
        url: "https://x.com/mrmr_0103/status/2067539299244110125?s=20"
    },
{
        date: "2026-06-21",
        title: "コンプレックスで顔を隠してしまう🌸に対して 💄🥀🍹🌙",
        url: "https://x.com/mrmr_0103/status/2068362219264557270?s=20"
    },
{
        date: "2026-06-21",
        title: "亡くなった🌸が残した『私のことは忘れてね』と書かれた手紙を見つけた 🍃⛪️🍺🕯️🌀☂️",
        url: "https://x.com/mrmr_0103/status/2068609079183102257?s=20"
    },
{
        date: "2026-06-22",
        title: "『私だけ見て』と泣きついたら ⛪️🧋⚜️🥼🌀☂️",
        url: "https://x.com/mrmr_0103/status/2069024721338048799?s=20"
    },
{
        date: "2026-06-23",
        title: "※夢 ☂️🌀",
        url: "https://x.com/mrmr_0103/status/2069200788363395321?s=20"
    },
{
        date: "2026-06-25",
        title: "監禁🥫されたことが嬉しくて堪らない🌸と彼ら ⛓️、追加リクエスト",
        url: "https://x.com/mrmr_0103/status/2070102259590168948?s=20"
    },
{
        date: "2026-06-25",
        title: "🌸『お人形みたいな綺麗な顔だね』 ※かなり捏造 🪆☂️🌀",
        url: "https://x.com/mrmr_0103/status/2070105277299609899?s=20"
    },
{
        date: "2026-06-27",
        title: "🌸から『嫉妬しちゃうから私以外に笑いかけないで』って言われた彼ら ⛪️⏳🍄🪙🌀☂️",
        url: "https://x.com/mrmr_0103/status/2070856704569540847?s=20"
    },
{
        date: "2026-06-28",
        title: "監禁🥫から逃げ出したら… 🪆☂️🌀",
        url: "https://x.com/mrmr_0103/status/2071198824866161092?s=20"
    },
{
        date: "2026-06-28",
        title: "※☂️夢(願望)",
        url: "https://x.com/mrmr_0103/status/2071243735942509056?s=20"
    },
{
        date: "2026-06-30",
        title: "🌸が幼児化して(記憶なし)いつ戻るか分からず少し悲しくなっちゃった彼ら 🍺🕯️⛪️🌀",
        url: "https://x.com/mrmr_0103/status/2071891509885231209?s=20"
    },
{
        date: "2026-07-04",
        title: "👨(※🌸への好意有)が🌸に🎁を渡している現場を目撃した彼ら (元はリクエストでしたが内容が若干ズレてしまったためボツ作。故に☂️はおまけ 🔷🐳☂️",
        url: "https://x.com/mrmr_0103/status/2073374128242041294?s=20"
    },
{
        date: "2026-07-05",
        title: "『もう限界、そっち(テイワッ卜)に行きたい』という🌸の言葉を聞いてしまった彼らの呟き (※🌸には聞こえない) 🌼/🍺/🔶/🌀/☂️/⚡️/🪽/🗝️/🌙",
        url: "https://x.com/mrmr_0103/status/2073723868930576721?s=20"
    },
{
        date: "2026-07-06",
        title: "リク 邪魔な👨を処理しているところを🌸に見られちゃった ※ヤンデレ、捏造 ❤️‍🔥🔷🥼🧪🌀☂️🦊❌",
        url: "https://x.com/mrmr_0103/status/2074101281954861315?s=20"
    },
{
        date: "2026-07-07",
        title: "愛の伝え方 🌀☂️🪆",
        url: "https://x.com/mrmr_0103/status/2074452658178638191?s=20"
    },
{
        date: "2026-07-09",
        title: "リク お互いに理解し合えているか不安になってしまった🌸に対して ❤️‍🔥/🦉/🌀/☂️",
        url: "https://x.com/mrmr_0103/status/2074938515545313421?s=20"
    },
{
        date: "2026-07-09",
        title: "寝言で他の👨の名前を呼んだとき 🌀/☂️",
        url: "https://x.com/mrmr_0103/status/2075169906191163704?s=20"
    },
{
        date: "2026-07-09",
        title: "☂️様時代は大切なものが増えることで足枷が増えると考えてたらいいな。",
        url: "https://x.com/mrmr_0103/status/2075178190235115998?s=20"
    },
{
        date: "2026-07-10",
        title: "喧嘩中に🌸から『じゃあ他の人のところに行く！』って言われたとき ❤️‍🔥/🍺/⛪️/🍄/🟩/🦇/🌀/☂️",
        url: "https://x.com/mrmr_0103/status/2075545479178547466?s=20"
    },
{
        date: "2026-07-11",
        title: "彼を『お兄ちゃん！』って呼んじゃった ❤️‍🔥/🌼/🔷/🌀",
        url: "https://x.com/mrmr_0103/status/2075916249117479041?s=20"
    },
{
        date: "2026-07-12",
        title: "リク 🌸から『子供扱いしないで！』って言われた彼ら ⛪️/🍺/🔷/🍁/🕯️/🟡/🌀/☂️",
        url: "https://x.com/mrmr_0103/status/2076280682851254367?s=20"
    },
{
        date: "2026-07-13",
        title: "🌸を元の世界に戻す道具を隠していたのがバレて『どうして渡してくれなかったの！』と言われた彼ら ❤️‍🔥/📘/🥃/🧪/🌀/☂️",
        url: "https://x.com/mrmr_0103/status/2076629334773879258?s=20"
    },
{
        date: "2026-07-14",
        title: "友達(👨)の家にお泊まりしてくる！ってでんわしたら ※現パ口想定 🍃/🌼/🍺/🔷/🌀/☂️",
        url: "https://x.com/mrmr_0103/status/2077007235381903626?s=20"
    },
{
        date: "2026-07-15",
        title: "元の世界に帰りたがっていた🌸が『貴方のことが好きだから帰りたくない』と言ってきたら ❤️‍🔥/⛪️/🧋/🟡/🕯️/🪆/🌀/☂️",
        url: "https://x.com/mrmr_0103/status/2077351021010108927?s=20"
    },
{
        date: "2026-07-16",
        title: "嫉妬してご機嫌斜めな🌸に対して Part2 🌼/⛪️/🍨/☂️",
        url: "https://x.com/mrmr_0103/status/2077721195005505945?s=20"
    },
{
        date: "2026-07-17",
        title: "🌸から『私みたいなのじゃなくて他の子と付き合ったら？』と言われた 🦚/🎩/🌀/☂️",
        url: "https://x.com/mrmr_0103/status/2078097772977545667?s=20"
    },
{
        date: "2026-07-19",
        title: "執行官様の役に立ちたいがあまりに怪我して帰ってきた部下(🌸)に対して 🧊⚔️/🧪/🌙/❌/☂️/🗝️/🦋/🪙/🐳",
        url: "https://x.com/mrmr_0103/status/2078797013572022715?s=20"
    },
{
        date: "2026-07-23",
        title: "許嫁がいる🌸から「攫ってくれる？」と言われたとき",
        url: "https://x.com/mrmr_0103/status/2080233971062091814?s=20"
    },
{
        date: "2026-07-24",
        title: "🌸から『私ばっかり好きみたい！』と言われた　⚖️/🌿/💄/🍹/🐈‍⬛/🌙/💎/🪽",
        url: "https://x.com/mrmr_0103/status/2080626196577157543?s=20"
    },
{
        date: "2026-07-25",
        title: "🌸から『貴方が彼ｉ氏ならいいのに』と言われた彼ら　🌼/🔷/🎩/🌀",
        url: "https://x.com/mrmr_0103/status/2081014710632411480?s=20"
    },
{
        date: "2026-07-27",
        title: "キスしようとしたけど恥ずかしくて途中でやめた🌸に対して　⛪️/🔷/🌀/☂️/💄/🍹",
        url: "https://x.com/mrmr_0103/status/2081683685582209068?s=20"
    },
{
        date: "2026-07-28",
        title: "🌸が『可愛いでしょ！』と目一杯おしゃれした自ｉ撮ｉりを送ったとき　❤️‍🔥/🌼/🍺/🍄/🌀/☂️　※現パロ",
        url: "https://x.com/mrmr_0103/status/2082035308342960280?s=20"
    },
{
        date: "2026-07-29",
        title: "🌸の家に男物の👕があった※(兄/弟)の👕",
        url: "https://x.com/mrmr_0103/status/2082409078064861259?s=20"
    },
{
        date: "2026-07-30",
        title: "連絡なしで日付が変わってから帰ってきた🌸に対して",
        url: "https://x.com/mrmr_0103/status/2082772488493379893?s=20"
    },
{
        date: "2026-07-31",
        title: "リク 彼と🎆を見ていたら ❤️‍🔥/🍺/🍁/🌀",
        url: "https://x.com/mrmr_0103/status/2083128185466896730?s=20"
    },
{
        date: "2026-08-01",
        title: "片方しか無事に出られない秘境※この条件は彼にだけ見えている",
        url: "https://x.com/mrmr_0103/status/2083494504485786098?s=20"
    },
{
        date: "2026-08-04",
        title: "リク 因習村の生贄になってしまった🌸の最期の日、彼は儀式中… →攫う →見届ける 🌀☂️",
        url: "https://x.com/mrmr_0103/status/2084577202218418625?s=20"
    },
{
        date: "2026-08-05",
        title: "蠟梅様お誕生日2026",
        url: ""
    },
{
        date: "2026-08-06",
        title: "男性執行官が怖い🌸(部下)に対して 🌙❌🗝️🦋",
        url: "https://x.com/mrmr_0103/status/2085297964189422011?s=20"
    },
{
        date: "2026-08-08",
        title: "🌸から『思わせぶりな態度はやめて』と言われた ❤️‍🔥/⛪️/🔷/🍄/🌀/☂️",
        url: "https://x.com/mrmr_0103/status/2086026219640987784?s=20"
    },
{
        date: "2026-08-11",
        title: "「そんな彼氏やめなよ」な彼女達 🕊️/💄/💧/📜/🐆/🌙",
        url: "https://x.com/mrmr_0103/status/2087106990476853319?s=20"
    },
{
        date: "2026-08-11",
        title: "自分がただの浮気相手だと気付いちゃった彼ら",
        url: "https://x.com/mrmr_0103/status/2087125742140445036?s=20"
    },
{
        date: "2026-08-16",
        title: "「いい子」って褒めて、とお願いしてみたときの彼ら",
        url: "https://x.com/mrmr_0103/status/2088929219137171480?s=20"
    },
{
        date: "2026-08-17",
        title: "元の世界に帰るはずだったのに失敗しちゃった🌸が彼に泣きついたら 🔷/📘/🟡/🐾/🌀/☂️",
        url: "https://x.com/mrmr_0103/status/2089290118477844678?s=20"
    },
{
        date: "2026-08-18",
        title: "“初めて”は面倒だと聞いた🌸が適当に捨ててくる！と言ったとき ❤️‍🔥/🍺/🍁/🌀",
        url: "https://x.com/mrmr_0103/status/2089410203594944745?s=20"
    },
{
        date: "2026-08-18",
        title: "雷恐怖症の🌸に対して 🌀/☂️",
        url: "https://x.com/mrmr_0103/status/2089602040733618416?s=20"
    },
{
        date: "2026-08-18",
        title: "🌸から『🎮に勝ったらなんでも言うこと聞いてあげる！』って言われたとき",
        url: "https://x.com/mrmr_0103/status/2089694476206002212?s=20"
    },
{
        date: "2026-08-19",
        title: "🌸を手に入れるため🌸の彼氏を手に掛けるヤンデレな彼女達Part2 	⚡️/💄/🌿/💧/🐈‍⬛/🩰",
        url: "https://x.com/mrmr_0103/status/2089950990783127790?s=20"
    },
{
        date: "2026-08-21",
        title: "バニ一衣装を着た🌸に対して",
        url: "https://x.com/mrmr_0103/status/2090486878348906845?s=20"
    },
{
        date: "2026-08-24",
        title: "“初めて”は面倒だと聞いた🌸が適当に捨ててくる！と言ったとき 🔷/🎧/🟩/🐾",
        url: "https://x.com/mrmr_0103/status/2091722017469030857?s=20"
    },
{
        date: "2026-08-27",
        title: "🌸から『私のことそんなに好きじゃないもんね』と言われた彼ら ❤️‍🔥/⚛️/🌀/☂️",
        url: "https://x.com/mrmr_0103/status/2092796915528433967?s=20"
    },
    {
        date: "2026-09-11",
        title: "リク 病弱な🌸に対して 🧊⚔️/🧪/🌙/❌/☂️/🗝️/🦋/🪙/🐳",
        url: "https://x.com/mrmr_0103/status/2098380156985573770?s=20"
    }
];

const calendar = document.getElementById("calendar");

const selectedDateResult =
        document.getElementById("selected-date-result");

const today = new Date();

let year = today.getFullYear();
let month = today.getMonth() + 1;

// カレンダーを表示する関数
function renderCalendar() {

    calendar.innerHTML = `
        <div>
            <button id="prev-month">← 前の月</button>
            <h2>${year}年${month}月</h2>
            <button id="next-month">次の月 →</button>
        </div>

        <div id="calendar-grid"></div>
    `;

    const calendarGrid = document.getElementById("calendar-grid");

    const weekdays = ["日", "月", "火", "水", "木", "金", "土"];

    for (let i = 0; i < weekdays.length; i++) {
        calendarGrid.innerHTML +=
            "<span>" + weekdays[i] + "</span>";
    }


    // その月の1日が何曜日か調べる
    const date = new Date(year, month - 1, 1);
    const dayOfweek = date.getDay();

    // その月が何日まであるか調べる
    const lastDay = new Date(year, month, 0).getDate();


    // 1日の前に空白を入れる
    for (let i = 0; i < dayOfweek; i++) {
        calendarGrid.innerHTML += "<span></span>";
    }


    // 1日～月末まで表示
for (let day = 1; day <= lastDay; day++) {

    const currentDate =
        year + "-" +
        String(month).padStart(2, "0") + "-" +
        String(day).padStart(2, "0");


    // その日の曜日を調べる
    const currentDayOfweek =
        new Date(year, month - 1, day).getDay();


    // 日曜日・土曜日のクラスを決める
    let dayClass = "";

    if (currentDayOfweek === 0) {
        dayClass = "sunday";
    } else if (currentDayOfweek === 6) {
        dayClass = "saturday";
    }


    let todaysActivities = [];


    // その日の活動を探す
    for (let i = 0; i < activities.length; i++) {

        if (activities[i].date === currentDate) {
            todaysActivities.push(activities[i]);
        }

    }

    // 活動がある場合
    if (todaysActivities.length > 0) {

        let html =
        '<span class="activity-day" data-date="'+ currentDate + '">' + 
        '<span class="' + dayClass + '">' +
        day +"</span><br>";


        // 活動をすべて表示
for (let i = 0; i < todaysActivities.length; i++) {

    if (todaysActivities[i].url !== "") {

        html +=
            '<a class="activity-title" href="' +
            todaysActivities[i].url +
            '" target="_blank">' +
            todaysActivities[i].title +
            "</a>";

    } else {

        html +=
            '<span class="activity-title">' +
            todaysActivities[i].title +
            "</span>";
    }
}

        html += "</span>";

        calendarGrid.innerHTML += html;


    // 活動がない場合
    } else {

        calendarGrid.innerHTML +=
            '<span class="' + dayClass + '">' +
            day +
            "</span>";

    }

}


    // 前の月ボタン
    const prevMonthButton =
        document.getElementById("prev-month");

    prevMonthButton.addEventListener("click", function() {

        month--;

        // 1月の前は前年の12月
        if (month === 0) {
            month = 12;
            year--;
        }

        renderCalendar();

    });


    // 次の月ボタン
    const nextMonthButton =
        document.getElementById("next-month");

    nextMonthButton.addEventListener("click", function() {

        month++;

        // 12月の次は翌年の1月
        if (month === 13) {
            month = 1;
            year++;
        }

        renderCalendar();

    });

    // 活動がある日をクリックしたとき
    const activityDays =
        document.querySelectorAll(".activity-day");

    for (let i = 0; i < activityDays.length; i++) {

        activityDays[i].addEventListener("click", function() {

    const selectedDate =
        activityDays[i].dataset.date;

        console.log("クリックされました！");
        console.log(selectedDate);

    let html =
        "<h3>" + selectedDate + "の活動</h3>";

    for (let j = 0; j < activities.length; j++) {

        if (activities[j].date === selectedDate) {

           if (activities[j].url !== "") {

    html +=
        '<a href="' +
        activities[j].url +
        '" target="_blank">' +
        activities[j].title +
        "</a>";

} else {

    html +=
        '<span class="activity-title">' +
        activities[j].title +
        "</span>";
}
        }

    }

    selectedDateResult.innerHTML = html;
    selectedDateResult.classList.add("show");
    
});

    }
}

// 最初にカレンダーを表示
renderCalendar();


// ====================
// 日付検索
// ====================

const searchDate =
    document.getElementById("search-date");

const searchButton =
    document.getElementById("search-button");


searchButton.addEventListener("click", function() {

    const date = searchDate.value;

    let searchActivities = [];


    // 入力された日付の活動を探す
    for (let i = 0; i < activities.length; i++) {

        if (activities[i].date === date) {
            searchActivities.push(activities[i]);
        }

    }


    const searchResult =
        document.getElementById("search-result");


    // 活動があった場合
    if (searchActivities.length > 0) {

        let html = "<h3>検索結果</h3>";


        for (let i = 0; i < searchActivities.length; i++) {

           if (searchActivities[i].url !== "") {

    html +=
        '<a href="' +
        searchActivities[i].url +
        '" target="_blank">' +
        searchActivities[i].title +
        "</a>";

} else {

    html +=
        '<span class="activity-title">' +
        searchActivities[i].title +
        "</span>";
}

        }

        searchResult.innerHTML = html;
        searchResult.classList.add("show");

    // 活動がなかった場合
    } else {

        searchResult.innerHTML =
            "<p>この日の活動はありません。</p>";

        searchResult.classList.add("show");

    }

});

const searchTitle = document.getElementById("search-title");
const titleSearchButton = document.getElementById("title-search-button");
const titleSearchResult = document.getElementById("title-search-result");

titleSearchButton.addEventListener("click", function() {

const words = searchTitle.value.split(/\s+/);

    let searchActivities = [];

    for (let i = 0; i < activities.length; i++) {

        for (let j = 0; j < words.length; j++) {

            if (activities[i].title.includes(words[j])) {
                searchActivities.push(activities[i]);
                break;
            }

        }
    }

if (searchActivities.length > 0) {

    let html = "<h3>検索結果</h3>";

for (let i = 0; i < searchActivities.length; i++) {

    html +=
        '<div class="title-search-item">' +
        '<div class="activity-date">' +
        searchActivities[i].date +
        "</div>";

    if (searchActivities[i].url !== "") {

        html +=
            '<a href="' +
            searchActivities[i].url +
            '" target="_blank">' +
            searchActivities[i].title +
            "</a>";

    } else {

        html +=
            '<span class="activity-title">' +
            searchActivities[i].title +
            "</span>";
    }

    html += "</div>";
}

    titleSearchResult.innerHTML = html;
    titleSearchResult.classList.add("show");

} else {

    titleSearchResult.innerHTML =
        "<p>該当する活動はありません。</p>";

    titleSearchResult.classList.add("show");
}
});

